SteffenLav/qmx-panadapter/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_0=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - HPI octal mode for Tab5
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# FreeRTOS
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Stacks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Cache
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Console UART baud rate -- bumped from 115200 to 921600 (8x). Cuts
# screenshot capture transfer time from ~3.5min to ~25s. idf.py monitor
# and `qmx m` pick this up automatically from project_description.json;
# tools/screenshot_decode.py and tools/capture_serial_log.ps1 must be
# updated to match.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
# Phase 2.1 - bump USB enum buffer for devices with large config descriptors (QMX has CDC + UAC)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# v1.3 engineering-sample silicon needs 360MHz max (400MHz default fails clock init)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_FONT_MONTSERRAT_32=y

# --------------------------------------------------------------------
# WiFi (ESP32-P4 via ESP32-C6 co-processor over SDIO using esp_hosted)
# Settings copied from N6HAN's qrp_companion which matches the Tab5
# factory C6 firmware (esp_hosted slave 1.4.0).
# --------------------------------------------------------------------
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
CONFIG_HTTPD_WS_SUPPORT=y

# LVGL memory pool -- bumped from 128 KB to 256 KB (v0.16.0) to accommodate
# pre-built modals + drawer + 40-row FT8 pool (~220 KB cumulative, up from
# ~110 KB at 20 rows). Pool is a .bss static array in internal SRAM.
CONFIG_LV_MEM_SIZE_KILOBYTES=1024


# Move LVGL static memory pool to PSRAM (.ext_ram.bss). Without this,
# the pool lives in internal SRAM (.bss) and steals DMA-capable memory
# from SDIO/USB. With PSRAM placement, the pool is effectively
# unlimited (28 MB free) and internal SRAM is preserved for DMA.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Per-task CPU usage accounting (util/cpu_stats.c): uxTaskGetSystemState with
# run-time counters + per-task core ID. Costs one 32-bit counter read per
# context switch (esp_timer based) — negligible; kept on permanently so any
# field diag log contains per-core CPU numbers (the CW-audio ghost task and
# the FT8-mode render waste were both invisible without these).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# USB DWC DMA buffers → PSRAM (ESP32-P4 DWC DMA can access external RAM).
# Without this, USB transfer descriptor lists and data buffers come from
# internal SRAM. After WiFi connects and consumes ~100 KB, the heap is
# fragmented to ~31 KB largest block — too small for USB EP alloc on
# reconnect. Routing USB DMA to PSRAM fixes the "no audio/CAT after QMX
# power-cycle" regression.
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# UAC ISO pipeline depth (#51 root-cause fix): 8 URBs x 40 packets x 1 ms =
# 320 ms of queued isochronous stream (was 3 x 3 = 9 ms). With only 9 ms of
# hardware autonomy, ANY >9 ms pause of the completion/resubmission pump (the
# level-1 USB interrupt + UAC bg task, both held off during the post-decode
# LVGL/LDPC storm) left the IN endpoint with no queued transfer - the QMX's
# audio was lost at the wire with zero error status (~170-350 ms every FT8
# slot, measured). Deep queuing rides through pump pauses up to ~300 ms and
# cuts completion-pump load 13x (25/s vs 328/s). Buffers are PSRAM (USB DWC
# DMA in PSRAM since v0.19.2), ~165 KB total.
CONFIG_UAC_NUM_ISOC_URBS=8
CONFIG_UAC_NUM_PACKETS_PER_URB=40

# TLS must not depend on the MALLOC_CAP_DMA pool (2026-08-04). ALL outbound
# HTTPS failed on the bench with:
#     esp-aes: Failed to allocate memory for the array of DMA descriptors
#     esp-tls-mbedtls: mbedtls_ctr_drbg_seed returned -0x0001
# Measured at the moment of failure: MALLOC_CAP_DMA free=167-263 B, largest
# free block 52-116 B - the pool is EMPTY, not merely fragmented, and a plain
# unaligned 48-byte DMA request fails too (so it is not an alignment issue).
# Meanwhile MALLOC_CAP_INTERNAL had 26-30 KB free with a 16-20 KB largest
# block: there is plenty of internal RAM, just none of it DMA-capable. This is
# the documented TODO #65 collapse (WiFi bring-up takes the pool to ~400 B and
# it never recovers) finally biting something user-visible.
#
# On ESP32-P4 SOC_AES_SUPPORT_DMA=1 and the IDF AES port has NO small-buffer
# fallback, so EVERY hardware-AES operation - including ctr_drbg's 16-byte
# ones - first allocates a descriptor array from MALLOC_CAP_DMA|INTERNAL
# (esp_aes_dma_core.c:422). With ~200 B free that can never succeed, so TLS
# could not even seed its RNG: spots, update_check and the QRZ/eQSL/LoTW
# uploads were all dead. Hardware SHA has the same dependency on its
# realloc/copy paths (sha/dma/sha.c:196,209,354), so it goes too or the
# failure just moves.
#
# MPI and ECC are deliberately LEFT ON: they are register-based and allocate
# no DMA memory, so RSA/ECDSA - the expensive part of a handshake - stays
# hardware-accelerated. What we give up is software AES-GCM/SHA over the
# payload, a few ms of CPU on a background task for a ~40 KB body.
#
# Do NOT turn these back on to "recover performance" without first fixing the
# DMA-pool collapse; hardware crypto that requires a runtime DMA allocation is
# fundamentally incompatible with a pool that sits near zero whenever WiFi is
# up. See TODO #65.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
# CONFIG_MBEDTLS_HARDWARE_GCM is not set
# CONFIG_MBEDTLS_HARDWARE_SHA is not set
